Tekla.Structures.Analysis.AnalysisMaterial.MaterialTypeEnum
The material types.

Tekla.Structures.Analysis.AnalysisMaterial.MaterialTypeEnum.STEEL
The steel material type.

Tekla.Structures.Analysis.AnalysisMaterial.MaterialTypeEnum.CONCRETE
The concrete material type.

Tekla.Structures.Analysis.AnalysisMaterial.MaterialTypeEnum.TIMBER
The timber material type.